Revit 2027 API
SpotDimension Properties
The SpotDimension type exposes the following members.
Properties
Name | Description
Above | The text shown above the segment's value.
(Inherited from Dimension)
AreReferencesAvailable |  Indicates if this dimension's references can be resolved.
(Inherited from Dimension)
AreSegmentsEqual | Indicates if all segments are forced to be equal.
(Inherited from Dimension)
AssemblyInstanceId |  The id of the assembly instance to which the element belongs.
(Inherited from Element)
Below | The text shown below the segment's value.
(Inherited from Dimension)
BoundingBox | Retrieves a box that circumscribes all geometry of the element.
(Inherited from Element)
Category | Retrieves a Category object that represents the category or sub category in which the element resides.
(Inherited from Element)
CreatedPhaseId |  Id of a Phase at which the Element was created.
(Inherited from Element)
Curve |  A curve that represents the dimension line.
(Inherited from Dimension)
DemolishedPhaseId |  Id of a Phase at which the Element was demolished.
(Inherited from Element)
DesignOption | Returns the design option to which the element belongs.
(Inherited from Element)
DimensionShape | The shape of this dimension.
(Inherited from Dimension)
DimensionType |  The dimension style of this dimension.
(Inherited from Dimension)
Document | Returns the Document in which the Element resides.
(Inherited from Element)
FamilyLabel | The family parameter label of the dimension.
(Inherited from Dimension)
Geometry | Retrieves the geometric representation of the element.
(Inherited from Element)
GroupId |  The id of the group to which an element belongs.
(Inherited from Element)
HasLeader |  True if dimension has leader, false otherwise.
(Inherited from Dimension)
Id |  A unique identifier for an Element in an Autodesk Revit project.
(Inherited from Element)
IsLocked |  Indicates if this dimension is locked.
(Inherited from Dimension)
IsModifiable |  Identifies if the element is modifiable.
(Inherited from Element)
IsTransient |  Indicates whether an element is transient or permanent.
(Inherited from Element)
IsValid |  Indicates if this dimension is valid.
(Inherited from Dimension)
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from Element)
LeaderEndPosition |  The position of the dimension's leader end point.
(Inherited from Dimension)
LeaderHasShoulder |  True is dimension has leader with shoulder, false otherwise.
LeaderShoulderPosition |  Position of spot dimension's leader shoulder point.
LevelId |  The id of the level associated with the element.
(Inherited from Element)
Location | This property is used to find the physical location of an element within a project.
(Inherited from Element)
Name | Retrieves or changes the name associated with the Dimension.
(Inherited from Dimension)
NumberOfSegments | The number of segments for the dimension.
(Inherited from Dimension)
Origin |  The dimension origin.
(Inherited from Dimension)
OwnerViewId |  The id of the view that owns the element.
(Inherited from Element)
Parameter[BuiltInParameter] | Retrieves a parameter from the element given a parameter id.
(Inherited from Element)
Parameter[Definition] | Retrieves a parameter from the element based on its definition.
(Inherited from Element)
Parameter[Guid] | Retrieves a parameter from the element given a GUID for a shared parameter.
(Inherited from Element)
Parameters | Retrieves a set containing all of the parameters that are contained within the element.
(Inherited from Element)
ParametersMap | Retrieves a map containing all of the parameters that are contained within the element.
(Inherited from Element)
Pinned |  Identifies if the element has been pinned to prevent changes.
(Inherited from Element)
Prefix | The text shown before the segment's value.
(Inherited from Dimension)
References |  Returns an array of geometric references to which the dimension is attached.
(Inherited from Dimension)
Segments | The segments in the dimension.
(Inherited from Dimension)
SpotDimensionType |  The dimension style of this dimension.
Suffix | The text shown after the segment's value.
(Inherited from Dimension)
TextPosition |  The position of the dimension text's drag point.
(Inherited from Dimension)
UniqueId |  A stable unique identifier for an element within the document.
(Inherited from Element)
Value |  The value of the dimension.
(Inherited from Dimension)
ValueOverride | The text that replaces the segment's value.
(Inherited from Dimension)
ValueString |  The dimension value as a user visible string.
(Inherited from Dimension)
VersionGuid |  Get the element version Guid.
(Inherited from Element)
View |  Supplies the view that contains the dimension if the dimension is view specific.
(Inherited from Dimension)
ViewSpecific |  Identifies if the element is owned by a view.
(Inherited from Element)
WorksetId |  Get Id of the Workset which owns the element.
(Inherited from Element)
Top
See Also
Reference
SpotDimension Class
Autodesk.Revit.DB Namespace